Oryx-Embedded/CycloneCRYPTO/hardware/max32690/max32690_crypto_cipher.c
/**
 * @file max32690_crypto_cipher.c
 * @brief MAX32690 cipher hardware accelerator
 *
 * @section License
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 *
 * Copyright (C) 2010-2026 Oryx Embedded SARL. All rights reserved.
 *
 * This file is part of CycloneCRYPTO Open.
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * as published by the Free Software Foundation; either version 2
 * of the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software Foundation,
 * Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.
 *
 * @author Oryx Embedded SARL (www.oryx-embedded.com)
 * @version 2.6.2
 **/

//Switch to the appropriate trace level
#define TRACE_LEVEL CRYPTO_TRACE_LEVEL

//Dependencies
#include "mxc_device.h"
#include "mxc_sys.h"
#include "ctb.h"
#include "core/crypto.h"
#include "hardware/max32690/max32690_crypto.h"
#include "hardware/max32690/max32690_crypto_cipher.h"
#include "cipher/cipher_algorithms.h"
#include "cipher_modes/cipher_modes.h"
#include "aead/aead_algorithms.h"
#include "debug.h"

//Check crypto library configuration
#if (MAX32690_CRYPTO_CIPHER_SUPPORT == ENABLED && AES_SUPPORT == ENABLED)


/**
 * @brief Load AES key
 * @param[in] context AES algorithm context
 **/

void aesLoadKey(AesContext *context)
{
   uint32_t temp;

   //Read cipher control register
   temp = MXC_CTB->cipher_ctrl & ~(MXC_F_CTB_CIPHER_CTRL_CIPHER |
      MXC_F_CTB_CIPHER_CTRL_SRC);

   //Load cipher key from CTB_CIPHER_KEY registers
   temp |= MXC_S_CTB_CIPHER_CTRL_SRC_CIPHERKEY;

   //Check the length of the key
   if(context->nr == 10)
   {
      //10 rounds are required for 128-bit key
      MXC_CTB->cipher_ctrl = temp | MXC_S_CTB_CIPHER_CTRL_CIPHER_AES128;

      //Set the 128-bit encryption key
      MXC_CTB->cipher_key[0] = context->ek[0];
      MXC_CTB->cipher_key[1] = context->ek[1];
      MXC_CTB->cipher_key[2] = context->ek[2];
      MXC_CTB->cipher_key[3] = context->ek[3];
   }
   else if(context->nr == 12)
   {
      //12 rounds are required for 192-bit key
      MXC_CTB->cipher_ctrl = temp | MXC_S_CTB_CIPHER_CTRL_CIPHER_AES192;

      //Set the 192-bit encryption key
      MXC_CTB->cipher_key[0] = context->ek[0];
      MXC_CTB->cipher_key[1] = context->ek[1];
      MXC_CTB->cipher_key[2] = context->ek[2];
      MXC_CTB->cipher_key[3] = context->ek[3];
      MXC_CTB->cipher_key[4] = context->ek[4];
      MXC_CTB->cipher_key[5] = context->ek[5];
   }
   else
   {
      //14 rounds are required for 256-bit key
      MXC_CTB->cipher_ctrl = temp | MXC_S_CTB_CIPHER_CTRL_CIPHER_AES256;

      //Set the 256-bit encryption key
      MXC_CTB->cipher_key[0] = context->ek[0];
      MXC_CTB->cipher_key[1] = context->ek[1];
      MXC_CTB->cipher_key[2] = context->ek[2];
      MXC_CTB->cipher_key[3] = context->ek[3];
      MXC_CTB->cipher_key[4] = context->ek[4];
      MXC_CTB->cipher_key[5] = context->ek[5];
      MXC_CTB->cipher_key[6] = context->ek[6];
      MXC_CTB->cipher_key[7] = context->ek[7];
   }
}


/**
 * @brief Perform AES encryption or decryption
 * @param[in] context AES algorithm context
 * @param[in,out] iv Initialization vector
 * @param[in] input Data to be encrypted/decrypted
 * @param[out] output Data resulting from the encryption/decryption process
 * @param[in] length Total number of data bytes to be processed
 * @param[in] mode Operation mode
 * @param[in] encrypt Encryption or decryption operation
 **/

void aesProcessData(AesContext *context, uint8_t *iv, const uint8_t *input,
   uint8_t *output, size_t length, uint32_t mode, bool_t encrypt)
{
   uint32_t temp;

   //Acquire exclusive access to the CTB module
   osAcquireMutex(&max32690CryptoMutex);

   //Reset the engine by setting CTB_CTRL.rst
   MXC_CTB->ctrl = MXC_F_CTB_CTRL_RST;

   //Software must poll the CTB_CTRL.rst bit until it is set to 1 by hardware,
   //indicating the cryptographic accelerator is ready for use
   while((MXC_CTB->ctrl & MXC_F_CTB_CTRL_RDY) == 0)
   {
   }

   //Legacy support for the access behavior of the done flags
   MXC_CTB->ctrl |= MXC_F_CTB_CTRL_FLAG_MODE;
   //Clear done flags
   MXC_CTB->ctrl |= MXC_F_CTB_CTRL_CPH_DONE | MXC_F_CTB_CTRL_GLS_DONE;

   //Select operation mode
   MXC_CTB->cipher_ctrl = (mode << MXC_F_CTB_CIPHER_CTRL_MODE_POS) &
      MXC_F_CTB_CIPHER_CTRL_MODE;

   //Set encryption key
   aesLoadKey(context);

   //Valid initialization vector?
   if(iv != NULL)
   {
      //Set initialization vector
      MXC_CTB->cipher_init[0] = __UNALIGNED_UINT32_READ(iv);
      MXC_CTB->cipher_init[1] = __UNALIGNED_UINT32_READ(iv + 4);
      MXC_CTB->cipher_init[2] = __UNALIGNED_UINT32_READ(iv + 8);
      MXC_CTB->cipher_init[3] = __UNALIGNED_UINT32_READ(iv + 12);
   }

   //Encryption or decryption operation?
   if(!encrypt)
   {
      MXC_CTB->cipher_ctrl |= MXC_F_CTB_CIPHER_CTRL_ENC;
   }
   else
   {
      MXC_CTB->cipher_ctrl &= ~MXC_F_CTB_CIPHER_CTRL_ENC;
   }

   //Process data
   while(length >= AES_BLOCK_SIZE)
   {
      //Write input block
      MXC_CTB->din[0] = __UNALIGNED_UINT32_READ(input);
      MXC_CTB->din[1] = __UNALIGNED_UINT32_READ(input + 4);
      MXC_CTB->din[2] = __UNALIGNED_UINT32_READ(input + 8);
      MXC_CTB->din[3] = __UNALIGNED_UINT32_READ(input + 12);

      //Wait until the operation is complete
      while((MXC_CTB->ctrl & MXC_F_CTB_CTRL_CPH_DONE) == 0)
      {
      }

      //Read output block
      temp = MXC_CTB->dout[0];
      __UNALIGNED_UINT32_WRITE(output, temp);
      temp = MXC_CTB->dout[1];
      __UNALIGNED_UINT32_WRITE(output + 4, temp);
      temp = MXC_CTB->dout[2];
      __UNALIGNED_UINT32_WRITE(output + 8, temp);
      temp = MXC_CTB->dout[3];
      __UNALIGNED_UINT32_WRITE(output + 12, temp);

      //Clear CTB_CTRL.cph_done flag
      MXC_CTB->ctrl |= MXC_F_CTB_CTRL_CPH_DONE;

      //Next block
      input += AES_BLOCK_SIZE;
      output += AES_BLOCK_SIZE;
      length -= AES_BLOCK_SIZE;
   }

   //Process final block of data
   if(length > 0)
   {
      uint32_t buffer[4];

      //Copy partial block
      osMemset(buffer, 0, AES_BLOCK_SIZE);
      osMemcpy(buffer, input, length);

